# Homework_11

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Ex.1 

Петя перешёл в другую школу. На уроке физкультуры ему понадобилось определить своё место в строю. Помогите ему это сделать.
Программа получает на вход невозрастающую последовательность натуральных чисел, означающих рост каждого человека в строю. После этого вводится число X – рост Пети. Все числа во входных данных натуральные и не превышают 200.
Выведите номер, под которым Петя должен встать в строй. Если в строю есть люди с одинаковым ростом, таким же, как у Пети, то он должен встать после них.

def find_position(order, height):
    return sum(1 for i in order if i >= height) + 1

order = list(map(int, input('Рост одноклассника:: ').split()))
height_Petya = int(input('Рост Пети: '))
result = find_position(order, height_Petya)
print("Позиция Пети: ", result)

----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

Ex.2

Создайте словарь всех покупателей и стоимости покупок (для каждого покупателя: стоимость покупки). найти для такого словаря:
    • максимальную стоимость покупки и кто совершил эту покупку
    • кол-во сделанных продаж


purchases = {
    'Покупатель номер 1': 150,
    'Покупатель номер 2': 200,
    'Покупатель номер 3': 130,
    'Покупатель номер 4': 250,
    'Покупатель номер 5': 180
}
Max_purchase = max(purchases, key=purchases.get)
Max_cost = purchases[Max_purchase]
print(f"Максимальная стоимость покупки: {Max_cost} у {Max_purchase}")
Number_of_sales = len(purchases)
print(f"Общее количество продаж: {Number_of_sales}")
